eseungho/OpenEPaperLink/ESP32_AP-Flasher/src/ble_filter.cpp
    tagRecord* taginfo = tagRecord::findByMAC(address);
    uint8_t hwType = (taginfo != nullptr) ? taginfo->hwType : 0;
    uint16_t width = 0, height = 0;
    switch (hwType) {
        case WOLINK_BLE_EPD_213_BWRY:
            width = 250;
            height = 128;
            break;
        case WOLINK_BLE_EPD_350_BWRY:
            width = 384;
            height = 184;
            break;
        case WOLINK_BLE_EPD_750_BWRY:
            width = 800;
            height = 480;
            break;
        default:
            Serial.printf("Wolink pack: unsupported hwType 0x%02X, canceling\r\n", hwType);
            prepareCancelPending(address);
            return 0;
    }
    const uint32_t byte_per_line = (uint32_t)height / 8;
    const uint32_t plane_size = (uint32_t)width * byte_per_line;
    // The 2.13"/3.5" take one 2bpp plane (width * height/4 bytes). The 7.5"
    // 800x480 controller does NOT: a uniform white image came back as a fine
    // stripe pattern, which is exactly what happens when our 2bpp white byte
    // (0x55) is read as a 1bpp plane (0101...). So the 7.5" expects TWO 1bpp
    // full-screen planes (a black/white plane and a red/yellow plane), not
    // 4 px/byte. Inferred without a reference capture -- see knobs below.
    const bool dual_plane = (hwType == WOLINK_BLE_EPD_750_BWRY);
    const uint32_t out_len = dual_plane
                                 ? 2u * plane_size                            // two 1bpp planes
                                 : (uint32_t)width * ((uint32_t)height / 4);  // one 2bpp plane

    if (out_len > max_len) {
        Serial.printf("Wolink pack: buffer too small (%u < %u)\r\n",
                      (unsigned)max_len, (unsigned)out_len);
        return 0;
    }
    if (queueItem->len < 2 * plane_size) {
        Serial.printf("Wolink pack: source too small (%u < %u)\r\n",
                      (unsigned)queueItem->len, (unsigned)(2 * plane_size));
        return 0;
    }

    memset(buffer, 0, out_len);

    if (dual_plane) {
        // EXPERIMENTAL inferred 7.5" format: two 1bpp planes, row-major,
        // 8 px/byte, MSB = leftmost pixel. Each pixel's proven 2-bit code
        // (B=00 W=01 Y=10 R=11) is split into its two bitplanes -- lo = code&1
        // (set for White/Red), hi = code>>1 (set for Yellow/Red) -- which
        // together still encode all four colors. If hardware disagrees, flip
        // ONE knob at a time and reflash (each is a single 0/1):
        //   _LO_PLANE_FIRST : which plane is sent first
        //   _INVERT_LO/_HI  : bit polarity of each plane (fixes inverted/odd colors)
        //   _FLIP_X/_FLIP_Y : mirror if the image is reversed L/R or up/down
        const int W75_LO_PLANE_FIRST = 1;
        const int W75_INVERT_LO      = 0;
        const int W75_INVERT_HI      = 0;
        const int W75_FLIP_X         = 0;
        const int W75_FLIP_Y         = 0;
        uint8_t* loPlane = buffer + (W75_LO_PLANE_FIRST ? 0 : plane_size);
        uint8_t* hiPlane = buffer + (W75_LO_PLANE_FIRST ? plane_size : 0);
        for (int x = 0; x < width; x++) {
            for (int y = 0; y < height; y++) {
                uint32_t off = (uint32_t)x * byte_per_line + (y / 8);
                uint8_t mask = 0x80 >> (y % 8);
                uint8_t p1 = (queueItem->data[off] & mask) ? 1 : 0;              // makeimage B/W plane
                uint8_t p2 = (queueItem->data[off + plane_size] & mask) ? 1 : 0; // makeimage color plane
                uint8_t color = ((uint8_t)(p2 & 1) << 1) | (uint8_t)(p1 ? 0 : 1);  // B=00 W=01 Y=10 R=11
                uint8_t lo = (uint8_t)((color & 1) ^ W75_INVERT_LO);
                uint8_t hi = (uint8_t)(((color >> 1) & 1) ^ W75_INVERT_HI);
                int px = W75_FLIP_X ? (width - 1 - x) : x;
                int py = W75_FLIP_Y ? (height - 1 - y) : y;
                uint32_t idx = (uint32_t)py * width + px;       // row-major along width
                uint32_t out_byte = idx >> 3;
                uint8_t out_bit = 0x80 >> (idx & 7);            // MSB = leftmost pixel
                if (lo) loPlane[out_byte] |= out_bit;
                if (hi) hiPlane[out_byte] |= out_bit;
            }
        }
        return out_len;
    }

    for (int x = 0; x < width; x++) {
        int phy_x = (width - 1) - x;                  // Wolink RAM is x-flipped too
        for (int y = 0; y < height; y++) {
            uint32_t off = (uint32_t)x * byte_per_line + (y / 8);
            uint8_t mask = 0x80 >> (y % 8);
            uint8_t p1 = (queueItem->data[off] & mask) ? 1 : 0;                 // B/W plane
            uint8_t p2 = (queueItem->data[off + plane_size] & mask) ? 1 : 0;    // color plane
            // Match the Phase 1 (GICisky BWRY) mapping: hi=p2, lo=~p1.
            // black (1,0)->00, white (0,0)->01, red (0,1)->11, yellow (1,1)->10.
            uint8_t color = ((uint8_t)(p2 & 1) << 1) | (uint8_t)(p1 ? 0 : 1);
            int phy_y = (height - 1) - y;                  // Wolink RAM is y-flipped
            uint32_t out_byte = (uint32_t)phy_x * (height / 4) + (phy_y / 4);
            int out_shift = 6 - (phy_y % 4) * 2;           // MSB-first within byte
            buffer[out_byte] |= color << out_shift;
        }
    }
    return out_len;
}

uint32_t get_ATC_BLE_OEPL_image(uint8_t address[8], uint8_t* buffer, uint32_t max_len, uint8_t* dataType, uint8_t* dataTypeArgument, uint16_t* nextCheckIn) {
    uint32_t t = millis();
    PendingItem* queueItem = getQueueItem(address, 0);
    if (queueItem == nullptr) {
        prepareCancelPending(address);
        Serial.printf("blockrequest: couldn't find taginfo %02X%02X%02X%02X%02X%02X%02X%02X\r\n", address[7], address[6], address[5], address[4], address[3], address[2], address[1], address[0]);
        return 0;
    }
    if (queueItem->data == nullptr) {
        fs::File file = contentFS->open(queueItem->filename);
        if (!file) {
            Serial.print("No current file. " + String(queueItem->filename) + " Canceling request\r\n");
            prepareCancelPending(address);
            return 0;
        }
        queueItem->data = getDataForFile(file);
        Serial.println("Reading file " + String(queueItem->filename) + " in  " + String(millis() - t) + "ms");
        file.close();
    }
    if (queueItem->len > max_len) {
        Serial.print("The upload is too big better cencel it\r\n");
        prepareCancelPending(address);
        return 0;
    }
    *dataType = queueItem->pendingdata.availdatainfo.dataType;
    *dataTypeArgument = queueItem->pendingdata.availdatainfo.dataTypeArgument;
    *nextCheckIn = queueItem->pendingdata.availdatainfo.nextCheckIn;
    uint32_t len_compressed = queueItem->len;
    memcpy(buffer, queueItem->data, queueItem->len);
    Serial.print("Data is prepared Len: " + String(queueItem->len) + "\r\n");
    return queueItem->len;
}

#endif
